feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Boot/Libraries/Infra/Sfr/TC27D/_Reg/IfxGtm_regdef.h
/** \brief  ATOM Channel Control in SOMI mode Register */
typedef struct _Ifx_GTM_ATOM_CH_SOMI_Bits
{
    Ifx_Strict_32Bit MODE:2;                /**< \brief [1:0] ATOM channel mode select (rw) */
    Ifx_Strict_32Bit reserved_2:1;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit ARU_EN:1;              /**< \brief [3:3] ARU Input stream enable (rw) */
    Ifx_Strict_32Bit ACB0:1;                /**< \brief [4:4] ACB bit 0 (rw) */
    Ifx_Strict_32Bit reserved_5:6;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SL:1;                  /**< \brief [11:11] Initial signal level after channel is enabled (rw) */
    Ifx_Strict_32Bit reserved_12:20;        /**< \brief \internal Reserved */
} Ifx_GTM_ATOM_CH_SOMI_Bits;

/** \brief  ATOM Channel Control in SOMP mode Register */
typedef struct _Ifx_GTM_ATOM_CH_SOMP_Bits
{
    Ifx_Strict_32Bit MODE:2;                /**< \brief [1:0] ATOM channel mode select (rw) */
    Ifx_Strict_32Bit reserved_2:1;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit ARU_EN:1;              /**< \brief [3:3] ARU Input stream enable (rw) */
    Ifx_Strict_32Bit ADL:2;                 /**< \brief [5:4] ARU data select for SOMP (r) */
    Ifx_Strict_32Bit reserved_6:5;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SL:1;                  /**< \brief [11:11] Signal level for pulse of PWM (rw) */
    Ifx_Strict_32Bit CLK_SRC_SR:3;          /**< \brief [14:12] Shadow register for CMU clock source register CLK_SRC (rw) */
    Ifx_Strict_32Bit reserved_15:5;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit RST_CCU0:1;            /**< \brief [20:20] Reset source of CCU0 (rw) */
    Ifx_Strict_32Bit reserved_21:3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit TRIGOUT:1;             /**< \brief [24:24] Trigger output selection (output signal TRIG_CHx) of module ATOM_CHx. (rw) */
    Ifx_Strict_32Bit reserved_25:1;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit OSM:1;                 /**< \brief [26:26] One-shot mode (rw) */
    Ifx_Strict_32Bit reserved_27:5;         /**< \brief \internal Reserved */
} Ifx_GTM_ATOM_CH_SOMP_Bits;

/** \brief  ATOM Channel Control in SOMS mode Register */
typedef struct _Ifx_GTM_ATOM_CH_SOMS_Bits
{
    Ifx_Strict_32Bit MODE:2;                /**< \brief [1:0] ATOM channel mode select (rw) */
    Ifx_Strict_32Bit reserved_2:1;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit ARU_EN:1;              /**< \brief [3:3] ARU Input stream enable (rw) */
    Ifx_Strict_32Bit ACB0:1;                /**< \brief [4:4] Shift direction for CM1 register (rw) */
    Ifx_Strict_32Bit reserved_5:6;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SL:1;                  /**< \brief [11:11] Defines signal level when channel and output is disable (rw) */
    Ifx_Strict_32Bit CLK_SRC:3;             /**< \brief [14:12] Shift frequency select for channel (rw) */
    Ifx_Strict_32Bit reserved_15:11;        /**< \brief \internal Reserved */
    Ifx_Strict_32Bit OSM:1;                 /**< \brief [26:26] One-shot mode (rw) */
    Ifx_Strict_32Bit reserved_27:5;         /**< \brief \internal Reserved */
} Ifx_GTM_ATOM_CH_SOMS_Bits;

/** \brief  ATOM Channel CCU0 Compare Shadow Register */
typedef struct _Ifx_GTM_ATOM_CH_SR0_Bits
{
    Ifx_Strict_32Bit SR0:24;                /**< \brief [23:0] ATOM channel x shadow register SR0 (rw) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_GTM_ATOM_CH_SR0_Bits;

/** \brief  ATOM Channel CCU1 Compare Shadow Register */
typedef struct _Ifx_GTM_ATOM_CH_SR1_Bits
{
    Ifx_Strict_32Bit SR1:24;                /**< \brief [23:0] ATOM channel x shadow register SR0 (rw) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_GTM_ATOM_CH_SR1_Bits;

/** \brief  ATOM Channel Status Register */
typedef struct _Ifx_GTM_ATOM_CH_STAT_Bits
{
    Ifx_Strict_32Bit OL:1;                  /**< \brief [0:0] Actual output signal level of ATOM_CHx_OUT (r) */
    Ifx_Strict_32Bit reserved_1:15;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit ACBI:5;                /**< \brief [20:16] ATOM Mode control bits received through ARU (r) */
    Ifx_Strict_32Bit DV:1;                  /**< \brief [21:21] Valid ARU Data stored in compare registers (r) */
    Ifx_Strict_32Bit WRF:1;                 /**< \brief [22:22] Write request of CPU failed for late update (rwh) */
    Ifx_Strict_32Bit reserved_23:1;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit ACBO:5;                /**< \brief [28:24] ATOM Internal status bits (r) */
    Ifx_Strict_32Bit reserved_29:3;         /**< \brief \internal Reserved */
} Ifx_GTM_ATOM_CH_STAT_Bits;

/** \brief  BRC Error Interrupt Enable Register */
typedef struct _Ifx_GTM_BRC_EIRQ_EN_Bits
{
    Ifx_Strict_32Bit DEST_ERR_EN:1;         /**< \brief [0:0] BRC_DEST_ERR_EIRQ error interrupt enable (rw) */
    Ifx_Strict_32Bit DID_EN0:1;             /**< \brief [1:1] BRC_DIDx_EIRQ error interrupt enable (rw) */
    Ifx_Strict_32Bit DID_EN1:1;             /**< \brief [2:2] BRC_DIDx_EIRQ error interrupt enable (rw) */
    Ifx_Strict_32Bit DID_EN2:1;             /**< \brief [3:3] BRC_DIDx_EIRQ error interrupt enable (rw) */
    Ifx_Strict_32Bit DID_EN3:1;             /**< \brief [4:4] BRC_DIDx_EIRQ error interrupt enable (rw) */
    Ifx_Strict_32Bit DID_EN4:1;             /**< \brief [5:5] BRC_DIDx_EIRQ error interrupt enable (rw) */
    Ifx_Strict_32Bit DID_EN5:1;             /**< \brief [6:6] BRC_DIDx_EIRQ error interrupt enable (rw) */
    Ifx_Strict_32Bit DID_EN6:1;             /**< \brief [7:7] BRC_DIDx_EIRQ error interrupt enable (rw) */
    Ifx_Strict_32Bit DID_EN7:1;             /**< \brief [8:8] BRC_DIDx_EIRQ error interrupt enable (rw) */
    Ifx_Strict_32Bit DID_EN8:1;             /**< \brief [9:9] BRC_DIDx_EIRQ error interrupt enable (rw) */
    Ifx_Strict_32Bit DID_EN9:1;             /**< \brief [10:10] BRC_DIDx_EIRQ error interrupt enable (rw) */
    Ifx_Strict_32Bit DID_EN10:1;            /**< \brief [11:11] BRC_DIDx_EIRQ error interrupt enable (rw) */
    Ifx_Strict_32Bit DID_EN11:1;            /**< \brief [12:12] BRC_DIDx_EIRQ error interrupt enable (rw) */
    Ifx_Strict_32Bit reserved_13:19;        /**< \brief \internal Reserved */
} Ifx_GTM_BRC_EIRQ_EN_Bits;

/** \brief  BRC Interrupt Enable Register */
typedef struct _Ifx_GTM_BRC_IRQ_EN_Bits
{
    Ifx_Strict_32Bit DEST_ERR_EN:1;         /**< \brief [0:0] BRC_DEST_ERR_IRQ interrupt enable (rw) */
    Ifx_Strict_32Bit DID_EN0:1;             /**< \brief [1:1] BRC_DIDx_IRQ interrupt enable (rw) */
    Ifx_Strict_32Bit DID_EN1:1;             /**< \brief [2:2] BRC_DIDx_IRQ interrupt enable (rw) */
    Ifx_Strict_32Bit DID_EN2:1;             /**< \brief [3:3] BRC_DIDx_IRQ interrupt enable (rw) */
    Ifx_Strict_32Bit DID_EN3:1;             /**< \brief [4:4] BRC_DIDx_IRQ interrupt enable (rw) */
    Ifx_Strict_32Bit DID_EN4:1;             /**< \brief [5:5] BRC_DIDx_IRQ interrupt enable (rw) */
    Ifx_Strict_32Bit DID_EN5:1;             /**< \brief [6:6] BRC_DIDx_IRQ interrupt enable (rw) */
    Ifx_Strict_32Bit DID_EN6:1;             /**< \brief [7:7] BRC_DIDx_IRQ interrupt enable (rw) */
    Ifx_Strict_32Bit DID_EN7:1;             /**< \brief [8:8] BRC_DIDx_IRQ interrupt enable (rw) */
    Ifx_Strict_32Bit DID_EN8:1;             /**< \brief [9:9] BRC_DIDx_IRQ interrupt enable (rw) */
    Ifx_Strict_32Bit DID_EN9:1;             /**< \brief [10:10] BRC_DIDx_IRQ interrupt enable (rw) */
    Ifx_Strict_32Bit DID_EN10:1;            /**< \brief [11:11] BRC_DIDx_IRQ interrupt enable (rw) */
    Ifx_Strict_32Bit DID_EN11:1;            /**< \brief [12:12] BRC_DIDx_IRQ interrupt enable (rw) */
    Ifx_Strict_32Bit reserved_13:19;        /**< \brief \internal Reserved */
} Ifx_GTM_BRC_IRQ_EN_Bits;

/** \brief  BRC_DEST_ERR Forcing Interrupt Register */
typedef struct _Ifx_GTM_BRC_IRQ_FORCINT_Bits
{
    Ifx_Strict_32Bit TRG_DEST_ERR:1;        /**< \brief [0:0] Trigger destination error interrupt (w) */
    Ifx_Strict_32Bit TRG_DID0:1;            /**< \brief [1:1] Trigger data inconsistency error interrupt (w) */
    Ifx_Strict_32Bit TRG_DID1:1;            /**< \brief [2:2] Trigger data inconsistency error interrupt (w) */
    Ifx_Strict_32Bit TRG_DID2:1;            /**< \brief [3:3] Trigger data inconsistency error interrupt (w) */
    Ifx_Strict_32Bit TRG_DID3:1;            /**< \brief [4:4] Trigger data inconsistency error interrupt (w) */
    Ifx_Strict_32Bit TRG_DID4:1;            /**< \brief [5:5] Trigger data inconsistency error interrupt (w) */
    Ifx_Strict_32Bit TRG_DID5:1;            /**< \brief [6:6] Trigger data inconsistency error interrupt (w) */
    Ifx_Strict_32Bit TRG_DID6:1;            /**< \brief [7:7] Trigger data inconsistency error interrupt (w) */
    Ifx_Strict_32Bit TRG_DID7:1;            /**< \brief [8:8] Trigger data inconsistency error interrupt (w) */
    Ifx_Strict_32Bit TRG_DID8:1;            /**< \brief [9:9] Trigger data inconsistency error interrupt (w) */
    Ifx_Strict_32Bit TRG_DID9:1;            /**< \brief [10:10] Trigger data inconsistency error interrupt (w) */
    Ifx_Strict_32Bit TRG_DID10:1;           /**< \brief [11:11] Trigger data inconsistency error interrupt (w) */
    Ifx_Strict_32Bit TRG_DID11:1;           /**< \brief [12:12] Trigger data inconsistency error interrupt (w) */
    Ifx_Strict_32Bit reserved_13:19;        /**< \brief \internal Reserved */
} Ifx_GTM_BRC_IRQ_FORCINT_Bits;

/** \brief  BRC IRQ Mode Configuration Register */
typedef struct _Ifx_GTM_BRC_IRQ_MODE_Bits
{
    Ifx_Strict_32Bit IRQ_MODE:2;            /**< \brief [1:0] IRQ mode selection (rw) */
    Ifx_Strict_32Bit reserved_2:30;         /**< \brief \internal Reserved */
} Ifx_GTM_BRC_IRQ_MODE_Bits;

/** \brief  BRC Interrupt Notification Register */
typedef struct _Ifx_GTM_BRC_IRQ_NOTIFY_Bits
{
    Ifx_Strict_32Bit DEST_ERR:1;            /**< \brief [0:0] Configuration error interrupt for BRC submodule (rwh) */
    Ifx_Strict_32Bit DID0:1;                /**< \brief [1:1] Data inconsistency occurred in MTM mode (rwh) */
    Ifx_Strict_32Bit DID1:1;                /**< \brief [2:2] Data inconsistency occurred in MTM mode (rwh) */
    Ifx_Strict_32Bit DID2:1;                /**< \brief [3:3] Data inconsistency occurred in MTM mode (rwh) */
    Ifx_Strict_32Bit DID3:1;                /**< \brief [4:4] Data inconsistency occurred in MTM mode (rwh) */
    Ifx_Strict_32Bit DID4:1;                /**< \brief [5:5] Data inconsistency occurred in MTM mode (rwh) */
    Ifx_Strict_32Bit DID5:1;                /**< \brief [6:6] Data inconsistency occurred in MTM mode (rwh) */
    Ifx_Strict_32Bit DID6:1;                /**< \brief [7:7] Data inconsistency occurred in MTM mode (rwh) */
    Ifx_Strict_32Bit DID7:1;                /**< \brief [8:8] Data inconsistency occurred in MTM mode (rwh) */
    Ifx_Strict_32Bit DID8:1;                /**< \brief [9:9] Data inconsistency occurred in MTM mode (rwh) */
    Ifx_Strict_32Bit DID9:1;                /**< \brief [10:10] Data inconsistency occurred in MTM mode (rwh) */
    Ifx_Strict_32Bit DID10:1;               /**< \brief [11:11] Data inconsistency occurred in MTM mode (rwh) */
    Ifx_Strict_32Bit DID11:1;               /**< \brief [12:12] Data inconsistency occurred in MTM mode (rwh) */
    Ifx_Strict_32Bit reserved_13:19;        /**< \brief \internal Reserved */
} Ifx_GTM_BRC_IRQ_NOTIFY_Bits;

