feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Boot/Libraries/Infra/Sfr/TC27D/_Reg/IfxGtm_regdef.h
/** \brief  Trigger Output Register */
typedef struct _Ifx_GTM_TRIGOUT_Bits
{
    Ifx_Strict_32Bit INT0:2;                /**< \brief [1:0] Interrupt Trigger Request 0 (w) */
    Ifx_Strict_32Bit INT1:2;                /**< \brief [3:2] Interrupt Trigger Request 1 (w) */
    Ifx_Strict_32Bit TRIG0:2;               /**< \brief [5:4] Trigger 0 (w) */
    Ifx_Strict_32Bit TRIG1:2;               /**< \brief [7:6] Trigger 1 (w) */
    Ifx_Strict_32Bit TRIG2:2;               /**< \brief [9:8] Trigger 2 (w) */
    Ifx_Strict_32Bit TRIG3:2;               /**< \brief [11:10] Trigger 3 (w) */
    Ifx_Strict_32Bit TRIG4:2;               /**< \brief [13:12] Trigger 4 (w) */
    Ifx_Strict_32Bit TRIG5:2;               /**< \brief [15:14] Trigger 5 (w) */
    Ifx_Strict_32Bit reserved_16:16;        /**< \brief \internal Reserved */
} Ifx_GTM_TRIGOUT_Bits;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Gtm_union
 * \{  */

/** \brief  Access Enable Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_ACCEN0_Bits B;                  /**< \brief Bitfield access */
} Ifx_GTM_ACCEN0;

/** \brief  Access Enable Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_ACCEN1_Bits B;                  /**< \brief Bitfield access */
} Ifx_GTM_ACCEN1;

/** \brief  ADC Trigger 0 Output Select 0 Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_ADCTRIG0OUT0_Bits B;            /**< \brief Bitfield access */
} Ifx_GTM_ADCTRIG0OUT0;

/** \brief  ADC Trigger 0 Output Select 1 Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_ADCTRIG0OUT1_Bits B;            /**< \brief Bitfield access */
} Ifx_GTM_ADCTRIG0OUT1;

/** \brief  ADC Trigger 1 Output Select 0 Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_ADCTRIG1OUT0_Bits B;            /**< \brief Bitfield access */
} Ifx_GTM_ADCTRIG1OUT0;

/** \brief  ADC Trigger 1 Output Select 1 Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_ADCTRIG1OUT1_Bits B;            /**< \brief Bitfield access */
} Ifx_GTM_ADCTRIG1OUT1;

/** \brief  GTM AEI Timeout Exception Address Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_AEI_ADDR_XPT_Bits B;            /**< \brief Bitfield access */
} Ifx_GTM_AEI_ADDR_XPT;

/** \brief  AFD0 FIFO0 Channel Buffer Access Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_AFD_CH_BUF_ACC_Bits B;          /**< \brief Bitfield access */
} Ifx_GTM_AFD_CH_BUF_ACC;

/** \brief  ARU Access Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_ARU_ARU_ACCESS_Bits B;          /**< \brief Bitfield access */
} Ifx_GTM_ARU_ARU_ACCESS;

/** \brief  ARU Access Register Upper Data Word */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_ARU_DATA_H_Bits B;              /**< \brief Bitfield access */
} Ifx_GTM_ARU_DATA_H;

/** \brief  ARU Access Register Lower Data Word */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_ARU_DATA_L_Bits B;              /**< \brief Bitfield access */
} Ifx_GTM_ARU_DATA_L;

/** \brief  Debug Access Channel 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_ARU_DBG_ACCESS0_Bits B;         /**< \brief Bitfield access */
} Ifx_GTM_ARU_DBG_ACCESS0;

/** \brief  Debug Access Channel 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_ARU_DBG_ACCESS1_Bits B;         /**< \brief Bitfield access */
} Ifx_GTM_ARU_DBG_ACCESS1;

/** \brief  Debug Access 0 Transfer Register Upper Data Word */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_ARU_DBG_DATA0_H_Bits B;         /**< \brief Bitfield access */
} Ifx_GTM_ARU_DBG_DATA0_H;

/** \brief  Debug Access 0 Transfer Register Lower Data Word */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_ARU_DBG_DATA0_L_Bits B;         /**< \brief Bitfield access */
} Ifx_GTM_ARU_DBG_DATA0_L;

/** \brief  Debug Access 1 Transfer Register Upper Data Word */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_ARU_DBG_DATA1_H_Bits B;         /**< \brief Bitfield access */
} Ifx_GTM_ARU_DBG_DATA1_H;

/** \brief  Debug Access 1 Transfer Register Lower Data Word */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_ARU_DBG_DATA1_L_Bits B;         /**< \brief Bitfield access */
} Ifx_GTM_ARU_DBG_DATA1_L;

