feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Boot/Libraries/Infra/Sfr/TC27D/_Reg/IfxGtm_regdef.h
/** \brief  ATOM Channel Control in SOMI mode Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_ATOM_CH_SOMI_Bits B;            /**< \brief Bitfield access */
} Ifx_GTM_ATOM_CH_SOMI;

/** \brief  ATOM Channel Control in SOMP mode Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_ATOM_CH_SOMP_Bits B;            /**< \brief Bitfield access */
} Ifx_GTM_ATOM_CH_SOMP;

/** \brief  ATOM Channel Control in SOMS mode Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_ATOM_CH_SOMS_Bits B;            /**< \brief Bitfield access */
} Ifx_GTM_ATOM_CH_SOMS;

/** \brief  ATOM Channel CCU0 Compare Shadow Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_ATOM_CH_SR0_Bits B;             /**< \brief Bitfield access */
} Ifx_GTM_ATOM_CH_SR0;

/** \brief  ATOM Channel CCU1 Compare Shadow Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_ATOM_CH_SR1_Bits B;             /**< \brief Bitfield access */
} Ifx_GTM_ATOM_CH_SR1;

/** \brief  ATOM Channel Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_ATOM_CH_STAT_Bits B;            /**< \brief Bitfield access */
} Ifx_GTM_ATOM_CH_STAT;

/** \brief  BRC Error Interrupt Enable Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_BRC_EIRQ_EN_Bits B;             /**< \brief Bitfield access */
} Ifx_GTM_BRC_EIRQ_EN;

/** \brief  BRC Interrupt Enable Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_BRC_IRQ_EN_Bits B;              /**< \brief Bitfield access */
} Ifx_GTM_BRC_IRQ_EN;

/** \brief  BRC_DEST_ERR Forcing Interrupt Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_BRC_IRQ_FORCINT_Bits B;         /**< \brief Bitfield access */
} Ifx_GTM_BRC_IRQ_FORCINT;

/** \brief  BRC IRQ Mode Configuration Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_BRC_IRQ_MODE_Bits B;            /**< \brief Bitfield access */
} Ifx_GTM_BRC_IRQ_MODE;

/** \brief  BRC Interrupt Notification Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_BRC_IRQ_NOTIFY_Bits B;          /**< \brief Bitfield access */
} Ifx_GTM_BRC_IRQ_NOTIFY;

/** \brief  BRC Software Reset Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_BRC_RST_Bits B;                 /**< \brief Bitfield access */
} Ifx_GTM_BRC_RST;

/** \brief  Read Address For Input Channel 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_BRC_SRC0_ADDR_Bits B;           /**< \brief Bitfield access */
} Ifx_GTM_BRC_SRC0_ADDR;

/** \brief  Destination Channels For Input Channel 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_BRC_SRC0_DEST_Bits B;           /**< \brief Bitfield access */
} Ifx_GTM_BRC_SRC0_DEST;

/** \brief  Read Address For Input Channel 10 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_BRC_SRC10_ADDR_Bits B;          /**< \brief Bitfield access */
} Ifx_GTM_BRC_SRC10_ADDR;

/** \brief  Destination Channels For Input Channel 10 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_BRC_SRC10_DEST_Bits B;          /**< \brief Bitfield access */
} Ifx_GTM_BRC_SRC10_DEST;

/** \brief  Read Address For Input Channel 11 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_BRC_SRC11_ADDR_Bits B;          /**< \brief Bitfield access */
} Ifx_GTM_BRC_SRC11_ADDR;

/** \brief  Destination Channels For Input Channel 11 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_BRC_SRC11_DEST_Bits B;          /**< \brief Bitfield access */
} Ifx_GTM_BRC_SRC11_DEST;

/** \brief  Read Address For Input Channel 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_BRC_SRC1_ADDR_Bits B;           /**< \brief Bitfield access */
} Ifx_GTM_BRC_SRC1_ADDR;

