feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Boot/Libraries/Infra/Sfr/TC27D/_Reg/IfxGtm_regdef.h
/** \brief  DPLL Actual RAM Pointer to RAM Regions 1C1, 1C2 and 1C4 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_APS_Bits B;                /**< \brief Bitfield access */
} Ifx_GTM_DPLL_APS;

/** \brief  DPLL Actual RAM Pointer to RAM Region 1C3 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_APS_1C3_Bits B;            /**< \brief Bitfield access */
} Ifx_GTM_DPLL_APS_1C3;

/** \brief  DPLL Old RAM Pointer and Offset Value for STATE */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_APS_SYNC_Bits B;           /**< \brief Bitfield access */
} Ifx_GTM_DPLL_APS_SYNC;

/** \brief  DPLL Actual RAM Pointer to RAM Regions 2A, B and D */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_APT_Bits B;                /**< \brief Bitfield access */
} Ifx_GTM_DPLL_APT;

/** \brief  DPLL Actual RAM Pointer to RAM Region 2C */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_APT_2C_Bits B;             /**< \brief Bitfield access */
} Ifx_GTM_DPLL_APT_2C;

/** \brief  DPLL Old RAM Pointer and Offset Value for TRIGGER */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_APT_SYNC_Bits B;           /**< \brief Bitfield access */
} Ifx_GTM_DPLL_APT_SYNC;

/** \brief  DPLL Prediction of the actual STATE Increment */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_CDT_SX_Bits B;             /**< \brief Bitfield access */
} Ifx_GTM_DPLL_CDT_SX;

/** \brief  DPLL Prediction of the nominal STATE increment duration */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_CDT_SX_NOM_Bits B;         /**< \brief Bitfield access */
} Ifx_GTM_DPLL_CDT_SX_NOM;

/** \brief  DPLL Prediction of the actual TRIGGER Increment */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_CDT_TX_Bits B;             /**< \brief Bitfield access */
} Ifx_GTM_DPLL_CDT_TX;

/** \brief  DPLL Prediction of the nominal TRIGGER Increment duration */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_CDT_TX_NOM_Bits B;         /**< \brief Bitfield access */
} Ifx_GTM_DPLL_CDT_TX_NOM;

/** \brief  DPLL Number of Sub-Pulses of SUB_INC1 in Continuous Mode */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_CNT_NUM1_Bits B;           /**< \brief Bitfield access */
} Ifx_GTM_DPLL_CNT_NUM1;

/** \brief  DPLL Number of Sub-Pulses of SUB_INC2 in Continuous Mode */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_CNT_NUM2_Bits B;           /**< \brief Bitfield access */
} Ifx_GTM_DPLL_CNT_NUM2;

/** \brief  DPLL Control 1 Shadow STATE Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits B;    /**< \brief Bitfield access */
} Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE;

/** \brief  DPLL Control Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_CTRL_0_Bits B;             /**< \brief Bitfield access */
} Ifx_GTM_DPLL_CTRL_0;

/** \brief  DPLL Control 0 Shadow STATE Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_CTRL_0_SHADOW_STATE_Bits B;    /**< \brief Bitfield access */
} Ifx_GTM_DPLL_CTRL_0_SHADOW_STATE;

/** \brief  DPLL Control0 Shadow Trigger Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_Bits B;  /**< \brief Bitfield access */
} Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER;

/** \brief  DPLL Control Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_CTRL_1_Bits B;             /**< \brief Bitfield access */
} Ifx_GTM_DPLL_CTRL_1;

/** \brief  DPLL Control 1 Shadow TRIGGER Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_Bits B;  /**< \brief Bitfield access */
} Ifx_GTM_DPLL_CTRL_1_SHADOW_TRIGGER;

/** \brief  DPLL Control Register 2 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_CTRL_2_Bits B;             /**< \brief Bitfield access */
} Ifx_GTM_DPLL_CTRL_2;

/** \brief  DPLL Control Register 3 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_CTRL_3_Bits B;             /**< \brief Bitfield access */
} Ifx_GTM_DPLL_CTRL_3;

