feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Boot/Libraries/Infra/Sfr/TC27D/_Reg/IfxGtm_regdef.h
/** \brief  DPLL Control Register 4 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_CTRL_4_Bits B;             /**< \brief Bitfield access */
} Ifx_GTM_DPLL_CTRL_4;

/** \brief  DPLL ACTION Time To React Before PSAi Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_DLA_Bits B;                /**< \brief Bitfield access */
} Ifx_GTM_DPLL_DLA;

/** \brief  DPLL Nominal STATE Increment Values for FULL_SCALE */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_DT_S_Bits B;               /**< \brief Bitfield access */
} Ifx_GTM_DPLL_DT_S;

/** \brief  DPLL Duration of Last STATE Increment [DT_S_ACT] */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_DT_S_ACT_Bits B;           /**< \brief Bitfield access */
} Ifx_GTM_DPLL_DT_S_ACT;

/** \brief  DPLL Duration of Last TRIGGER Increment */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_DT_T_ACT_Bits B;           /**< \brief Bitfield access */
} Ifx_GTM_DPLL_DT_T_ACT;

/** \brief  DPLL Calculated Relat0ve Time To ACTION_i Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_DTA_Bits B;                /**< \brief Bitfield access */
} Ifx_GTM_DPLL_DTA;

/** \brief  DPLL Difference of Prediction to actual value for Last STATE
 * Increment */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_EDT_S_Bits B;              /**< \brief Bitfield access */
} Ifx_GTM_DPLL_EDT_S;

/** \brief  DPLL Difference of prediction to actual value of the last TRIGGER
 * increment */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_EDT_T_Bits B;              /**< \brief Bitfield access */
} Ifx_GTM_DPLL_EDT_T;

/** \brief  DPLL Error Interrupt Enable Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_EIRQ_EN_Bits B;            /**< \brief Bitfield access */
} Ifx_GTM_DPLL_EIRQ_EN;

/** \brief  DPLL Actual Signal STATE Filter Value Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_FTV_S_Bits B;              /**< \brief Bitfield access */
} Ifx_GTM_DPLL_FTV_S;

/** \brief  DPLL Actual Signal TRIGGER Filter Value Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_FTV_T_Bits B;              /**< \brief Bitfield access */
} Ifx_GTM_DPLL_FTV_T;

/** \brief  DPLL ID Information For Input Signal PMTR Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_ID_PMTR_Bits B;            /**< \brief Bitfield access */
} Ifx_GTM_DPLL_ID_PMTR;

/** \brief  DPLL Counter for Pulses for TBU_TS1 to be sent in Automatic End Mode */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_INC_CNT1_Bits B;           /**< \brief Bitfield access */
} Ifx_GTM_DPLL_INC_CNT1;

/** \brief  DPLL Counter for Pulses for TBU_TS2 to be sent in Automatic End Mode
 * when SMC=RMO=1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_INC_CNT2_Bits B;           /**< \brief Bitfield access */
} Ifx_GTM_DPLL_INC_CNT2;

/** \brief  DPLL Interrupt Enable Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_IRQ_EN_Bits B;             /**< \brief Bitfield access */
} Ifx_GTM_DPLL_IRQ_EN;

/** \brief  DPLL Interrupt Force Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_IRQ_FORCINT_Bits B;        /**< \brief Bitfield access */
} Ifx_GTM_DPLL_IRQ_FORCINT;

/** \brief  DPLL Interrupt Mode Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_IRQ_MODE_Bits B;           /**< \brief Bitfield access */
} Ifx_GTM_DPLL_IRQ_MODE;

/** \brief  DPLL Interrupt Notification Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_IRQ_NOTIFY_Bits B;         /**< \brief Bitfield access */
} Ifx_GTM_DPLL_IRQ_NOTIFY;

/** \brief  DPLL Weighted difference of Prediction up to the Last STATE
 * Increment */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_MEDT_S_Bits B;             /**< \brief Bitfield access */
} Ifx_GTM_DPLL_MEDT_S;

/** \brief  DPLL Weighted difference of Prediction up to the Last TRIGGER
 * Increment */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_MEDT_T_Bits B;             /**< \brief Bitfield access */
} Ifx_GTM_DPLL_MEDT_T;

/** \brief  DPLL Calculated Number of Sub-Pulses between Two STATE Events */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_MLS1_Bits B;               /**< \brief Bitfield access */
} Ifx_GTM_DPLL_MLS1;

/** \brief  DPLL Calculated Number of Sub-Pulses between Two STATE Events */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_MLS2_Bits B;               /**< \brief Bitfield access */
} Ifx_GTM_DPLL_MLS2;

/** \brief  DPLL Missing Pulses to be Added/Subtracted Directly to SUB_INC1 and
 * INC_CNT1 Once */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_MPVAL1_Bits B;             /**< \brief Bitfield access */
} Ifx_GTM_DPLL_MPVAL1;

/** \brief  DPLL Missing Pulses to be Added/Subtracted Directly to SUB_INC2 and
 * INC_CNT2 Once */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_MPVAL2_Bits B;             /**< \brief Bitfield access */
} Ifx_GTM_DPLL_MPVAL2;

/** \brief  DPLL Calculated Number Of TRIGGER/STATE Increments To ACTION */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_NA_Bits B;                 /**< \brief Bitfield access */
} Ifx_GTM_DPLL_NA;

/** \brief  DPLL Number of Pulses of Current Increment in Emergency Mode */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_NMB_S_Bits B;              /**< \brief Bitfield access */
} Ifx_GTM_DPLL_NMB_S;

/** \brief  DPLL Target Number of Pulses to be sent in emergency mode Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_NMB_S_TAR_Bits B;          /**< \brief Bitfield access */
} Ifx_GTM_DPLL_NMB_S_TAR;

/** \brief  DPLL Target Number of Pulses to be sent in emergency mode Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_NMB_S_TAR_OLD_Bits B;      /**< \brief Bitfield access */
} Ifx_GTM_DPLL_NMB_S_TAR_OLD;

/** \brief  DPLL Number of Pulses of Current Increment in Normal Mode */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_NMB_T_Bits B;              /**< \brief Bitfield access */
} Ifx_GTM_DPLL_NMB_T;

/** \brief  DPLL Target Number of Pulses to be sent in normal mode Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_NMB_T_TAR_Bits B;          /**< \brief Bitfield access */
} Ifx_GTM_DPLL_NMB_T_TAR;

/** \brief  DPLL Target Number of Pulses to be sent in normal mode Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_NMB_T_TAR_OLD_Bits B;      /**< \brief Bitfield access */
} Ifx_GTM_DPLL_NMB_T_TAR_OLD;

/** \brief  DPLL Number of Active TRIGGER Events to Interrupt */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_NTI_CNT_Bits B;            /**< \brief Bitfield access */
} Ifx_GTM_DPLL_NTI_CNT;

/** \brief  DPLL Number of Recent STATE Events Used for Calculations */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_NUSC_Bits B;               /**< \brief Bitfield access */
} Ifx_GTM_DPLL_NUSC;

/** \brief  DPLL Number of Recent TRIGGER Events Used for Calculations */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_NUTC_Bits B;               /**< \brief Bitfield access */
} Ifx_GTM_DPLL_NUTC;

/** \brief  DPLL Offset And Switch Old/New Address Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_OSW_Bits B;                /**< \brief Bitfield access */
} Ifx_GTM_DPLL_OSW;

/** \brief  DPLL Projected TRIGGER Increment Sum Relat0ons for Action_i */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_PDT_T_Bits B;              /**< \brief Bitfield access */
} Ifx_GTM_DPLL_PDT_T;

