feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Boot/Libraries/Infra/Sfr/TC27D/_Reg/IfxGtm_regdef.h
/** \brief  DPLL ACTION Position/Value Action Request Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_PSA_Bits B;                /**< \brief Bitfield access */
} Ifx_GTM_DPLL_PSA;

/** \brief  DPLL Calculated Position Value Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_PSAC_Bits B;               /**< \brief Bitfield access */
} Ifx_GTM_DPLL_PSAC;

/** \brief  DPLL Accurate Calculated Position Stamp of Last STATE Input */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_PSSC_Bits B;               /**< \brief Bitfield access */
} Ifx_GTM_DPLL_PSSC;

/** \brief  DPLL Measured Position Stamp of Last STATE Input */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_PSSM_0_Bits B;             /**< \brief Bitfield access */
} Ifx_GTM_DPLL_PSSM_0;

/** \brief  DPLL Measured Position Stamp of Last STATE Input */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_PSSM_1_Bits B;             /**< \brief Bitfield access */
} Ifx_GTM_DPLL_PSSM_1;

/** \brief  DPLL Actual Calculated Position Stamp of Last TRIGGER Input */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_PSTC_Bits B;               /**< \brief Bitfield access */
} Ifx_GTM_DPLL_PSTC;

/** \brief  DPLL Measured Position Stamp of Last TRIGGER Input */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_PSTM_0_Bits B;             /**< \brief Bitfield access */
} Ifx_GTM_DPLL_PSTM_0;

/** \brief  DPLL Measured Position Stamp of Last TRIGGER Input */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_PSTM_1_Bits B;             /**< \brief Bitfield access */
} Ifx_GTM_DPLL_PSTM_1;

/** \brief  DPLL Plausibility Value of Next Active TRIGGER Slope */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_PVT_Bits B;                /**< \brief Bitfield access */
} Ifx_GTM_DPLL_PVT;

/** \brief  DPLL RAM Initatlisation Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_RAM_INI_Bits B;            /**< \brief Bitfield access */
} Ifx_GTM_DPLL_RAM_INI;

/** \brief  DPLL Reciprocal Value of Expected Increment Duration STATE */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_RCDT_SX_Bits B;            /**< \brief Bitfield access */
} Ifx_GTM_DPLL_RCDT_SX;

/** \brief  DPLL Reciprocal Value of the Expected Nominal Increment Duration
 * STATE */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_RCDT_SX_NOM_Bits B;        /**< \brief Bitfield access */
} Ifx_GTM_DPLL_RCDT_SX_NOM;

/** \brief  DPLL Reciprocal Value of Expected Increment Duration TRIGGER */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_RCDT_TX_Bits B;            /**< \brief Bitfield access */
} Ifx_GTM_DPLL_RCDT_TX;

/** \brief  DPLL Reciprocal Value of the Expected Nominal Increment Duration
 * TRIGGER */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_RCDT_TX_NOM_Bits B;        /**< \brief Bitfield access */
} Ifx_GTM_DPLL_RCDT_TX_NOM;

/** \brief  DPLL Nominal STATE Reciprocal Values in FULL_SCALE */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_RDT_S_Bits B;              /**< \brief Bitfield access */
} Ifx_GTM_DPLL_RDT_S;

/** \brief  DPLL Actual Reciprocal Value of STATE */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_RDT_S_ACT_Bits B;          /**< \brief Bitfield access */
} Ifx_GTM_DPLL_RDT_S_ACT;

/** \brief  DPLL Actual Reciprocal Value of TRIGGER */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_RDT_T_ACT_Bits B;          /**< \brief Bitfield access */
} Ifx_GTM_DPLL_RDT_T_ACT;

/** \brief  DPLL STATE Locking Range */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_SLR_Bits B;                /**< \brief Bitfield access */
} Ifx_GTM_DPLL_SLR;

/** \brief  DPLL Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_STATUS_Bits B;             /**< \brief Bitfield access */
} Ifx_GTM_DPLL_STATUS;

/** \brief  DPLL TBU_TS0 Value at last STATE Event */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_TBU_TS0_S_Bits B;          /**< \brief Bitfield access */
} Ifx_GTM_DPLL_TBU_TS0_S;

/** \brief  DPLL TBU_TS0 Value at last TRIGGER Event */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_TBU_TS0_T_Bits B;          /**< \brief Bitfield access */
} Ifx_GTM_DPLL_TBU_TS0_T;

/** \brief  DPLL TRIGGER Hold Time Max Value */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_THMA_Bits B;               /**< \brief Bitfield access */
} Ifx_GTM_DPLL_THMA;

/** \brief  DPLL TRIGGER hold time min value */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_THMI_Bits B;               /**< \brief Bitfield access */
} Ifx_GTM_DPLL_THMI;

/** \brief  DPLL Measured Last Pulse Time from Valid to Invalid TRIGGER Slope */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_THVAL_Bits B;              /**< \brief Bitfield access */
} Ifx_GTM_DPLL_THVAL;

/** \brief  DPLL TRIGGER locking range */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_TLR_Bits B;                /**< \brief Bitfield access */
} Ifx_GTM_DPLL_TLR;

/** \brief  DPLL Time Out Value of active TRIGGER Slope */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_TOV_Bits B;                /**< \brief Bitfield access */
} Ifx_GTM_DPLL_TOV;

/** \brief  DPLL Time Out Value of active STATE Slope */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_TOV_S_Bits B;              /**< \brief Bitfield access */
} Ifx_GTM_DPLL_TOV_S;

/** \brief  DPLL Actual Signal STATE Time Stamp Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_TS_S_0_Bits B;             /**< \brief Bitfield access */
} Ifx_GTM_DPLL_TS_S_0;

/** \brief  DPLL Actual Signal STATE Time Stamp Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_TS_S_1_Bits B;             /**< \brief Bitfield access */
} Ifx_GTM_DPLL_TS_S_1;

/** \brief  DPLL Actual Signal TRIGGER Time Stamp Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_TS_T_0_Bits B;             /**< \brief Bitfield access */
} Ifx_GTM_DPLL_TS_T_0;

/** \brief  DPLL Actual Signal TRIGGER Time Stamp Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_TS_T_1_Bits B;             /**< \brief Bitfield access */
} Ifx_GTM_DPLL_TS_T_1;

/** \brief  DPLL Calculate Time Stamp Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_TSAC_Bits B;               /**< \brief Bitfield access */
} Ifx_GTM_DPLL_TSAC;

/** \brief  DPLL Time Stamp Field of STATE Events */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DPLL_TSF_S_Bits B;              /**< \brief Bitfield access */
} Ifx_GTM_DPLL_TSF_S;

