feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Boot/Libraries/Infra/Sfr/TC27D/_Reg/IfxGtm_regdef.h
/** \brief  Data Exchange Input Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DXINCON_Bits B;                 /**< \brief Bitfield access */
} Ifx_GTM_DXINCON;

/** \brief  Data Exchange Output Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_DXOUTCON_Bits B;                /**< \brief Bitfield access */
} Ifx_GTM_DXOUTCON;

/** \brief  GTM Error Interrupt Enable Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_EIRQ_EN_Bits B;                 /**< \brief Bitfield access */
} Ifx_GTM_EIRQ_EN;

/** \brief  F2A0 Stream Activation Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_F2A_ENABLE_Bits B;              /**< \brief Bitfield access */
} Ifx_GTM_F2A_ENABLE;

/** \brief  F2A Read Channel Address Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_F2A_RD_CH_ARU_RD_FIFO_Bits B;   /**< \brief Bitfield access */
} Ifx_GTM_F2A_RD_CH_ARU_RD_FIFO;

/** \brief  F2A Stream Configuration Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_F2A_STR_CH_STR_CFG_Bits B;      /**< \brief Bitfield access */
} Ifx_GTM_F2A_STR_CH_STR_CFG;

/** \brief  FIFO0 Channel Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_FIFO_CH_CTRL_Bits B;            /**< \brief Bitfield access */
} Ifx_GTM_FIFO_CH_CTRL;

/** \brief  FIFO0 Channel Error Interrupt Enable Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_FIFO_CH_EIRQ_EN_Bits B;         /**< \brief Bitfield access */
} Ifx_GTM_FIFO_CH_EIRQ_EN;

/** \brief  FIFO0 Channel End Address Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_FIFO_CH_END_ADDR_Bits B;        /**< \brief Bitfield access */
} Ifx_GTM_FIFO_CH_END_ADDR;

/** \brief  FIFO0 Channel Fill Level Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_FIFO_CH_FILL_LEVEL_Bits B;      /**< \brief Bitfield access */
} Ifx_GTM_FIFO_CH_FILL_LEVEL;

/** \brief  FIFO0 Channel Interrupt Enable Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_FIFO_CH_IRQ_EN_Bits B;          /**< \brief Bitfield access */
} Ifx_GTM_FIFO_CH_IRQ_EN;

/** \brief  FIFO0 Channel Force Interrupt By Software Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_FIFO_CH_IRQ_FORCINT_Bits B;     /**< \brief Bitfield access */
} Ifx_GTM_FIFO_CH_IRQ_FORCINT;

/** \brief  FIFO0 Channel IRQ Mode Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_FIFO_CH_IRQ_MODE_Bits B;        /**< \brief Bitfield access */
} Ifx_GTM_FIFO_CH_IRQ_MODE;

/** \brief  FIFO0 Channel Interrupt Notification Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_FIFO_CH_IRQ_NOTIFY_Bits B;      /**< \brief Bitfield access */
} Ifx_GTM_FIFO_CH_IRQ_NOTIFY;

/** \brief  FIFO0 Channel Lower Watermark Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_FIFO_CH_LOWER_WM_Bits B;        /**< \brief Bitfield access */
} Ifx_GTM_FIFO_CH_LOWER_WM;

/** \brief  FIFO0 Channel Read Pointer Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_FIFO_CH_RD_PTR_Bits B;          /**< \brief Bitfield access */
} Ifx_GTM_FIFO_CH_RD_PTR;

/** \brief  FIFO0 Channel Start Address Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_FIFO_CH_START_ADDR_Bits B;      /**< \brief Bitfield access */
} Ifx_GTM_FIFO_CH_START_ADDR;

/** \brief  FIFO0 Channel Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_FIFO_CH_STATUS_Bits B;          /**< \brief Bitfield access */
} Ifx_GTM_FIFO_CH_STATUS;

/** \brief  FIFO0 Channel Upper Watermark Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_GTM_FIFO_CH_UPPER_WM_Bits B;        /**< \brief Bitfield access */
} Ifx_GTM_FIFO_CH_UPPER_WM;

